app/Http/Controllers/Api/AuthController.php

    public function login(Request $request)
    {
        $request->validate([
            'email' => "required|email",
            "password" => "required"
        ]);

        $user = User::where('email', $request->email)->first();
---
select * from `users` where `email` = 'islamkabbary@gmail.com' limit 1