app/Http/Controllers/Api/PostController.php

select * from `posts`
---
    public function index()
    {
        return ApiResponse::success(["posts" => PostResource::collection(Post::all())],"Posts Fetched successfuly",200);

insert into `posts` (`content`, `image`, `title`, `user_id`, `updated_at`, `created_at`) values ('test from api1', 'posts/1753206649_contact-bg.jpg', 'test from api1', 1, '2025-07-22 17:50:49', '2025-07-22 17:50:49')
---
    public function store(StorePostRequest $request)
    {
        $data = $request->validated();

        if ($request->hasFile('image')) {
            $image = $request->file('image');
            // file_name - upload image in storage - save to var
            $fileName = time() . "_" . $image->getClientOriginalName();
            $url = Storage::disk("public")->putFileAs("posts", $image, $fileName);
            $data['image'] = $url;
        }


        $data['user_id'] = 1;
        $post = Post::create($data);