app/Http/Controllers/PageController.php

    public function home()
    {
        $posts = Post::paginate(5);
---
select * from `posts` limit 5 offset 0
select count(*) as aggregate from `posts`