app/Http/Controllers/PostController.php

select * from `posts` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `posts`
---
    public function index()
    {
        $posts = Post::orderBy('id', 'desc')->paginate(10);